<template>
  <v-card>
    <v-card-title class="headline">利用規約</v-card-title>
    <v-card-text class="text">
      <b>Rits知恵袋 利用規約</b><br>
      利用のルール<br>
      Rits知恵袋は、その内容を立命館大学の学生みなさんで作っていくサービスです。<br>
      たくさんの方々がご利用し、さまざまな価値観が交わされる場であるからこそ、時にはなじみのない意見に出合ったり、不快と感じられるような経験をされることがあるかもしれません。<br>
      ご利用にあたっては、こうしたサービスの趣旨をご理解いただいたうえでのご利用をお願いいたします。なお、運営としては、できるかぎり多くの方々に快適にご利用いただける環境をご提供するために、誹謗中傷など明らかに悪意のある行為や不正利用には、強制的にメッセージを削除する等厳しく対処してまいりますので、一部の心ない方に心をわずらわされることなく、Rits知恵袋をご利用いただきますようお願いいたします。<br>
      <br>

      ●禁止事項について<br>
      快適にサービスをご利用いただくために、Rits知恵袋では以下の事項を禁止しています。<br>
      <br>禁止事項1：誹謗（ひぼう）中傷など他人を攻撃したり、傷つける内容の投稿<br>
      いやがらせ、悪口、脅しなど、他人の権利を侵害し、または他人の迷惑となるような投稿を行うことは禁止しています。<br>
      このような内容の投稿をした場合、ほかの参加者を不快にさせるだけでなく、投稿した本人が民事上あるいは刑事上の責任を追及される可能性があります。行動の結果は、ご自身で責任を負うことになりますので、ご注意ください。<br>
      <br>禁止事項2：社会規範および公序良俗に反する内容の投稿<br>
      社会通念上、わいせつ、不愉快だと感じる可能性のある内容や画像の投稿、またはこれらの内容を含むウェブページのURLを掲載することは禁止しています。<br>
      なお、わいせつな内容や画像の投稿は、刑事罰の対象になる場合もあります。<br>
      また法令違反や犯罪行為の誘発・実行の暗示、いたずらの意図がうかがえる内容など、ほかの参加者の気持ちを不快にさせるような内容の投稿も禁止しています。<br>
      <br>禁止事項3：商業目的や広告目的で利用すること<br>
      Rits知恵袋を商業目的や広告目的に利用することは禁止しています。<br>
      下記のような利用は、商業目的や広告目的の利用であると判断する場合があります。<br>
      * 商品の売買や金銭授受を目的とした利用<br>
      * サークルの勧誘に関する利用<br>
      <br>禁止事項4：個人を特定できる情報の投稿<br>
      ご自身のものであるか他人のものであるかを問わず、個人を特定できる情報（氏名、住所、電話番号、メールアドレスなど）の公開は禁止しています。<br>
      他人の名前、住所、電話番号、メールアドレス、IPアドレス、口座番号、自動車のナンバーなど、個人情報やそれに準ずる情報の公開はプライバシー侵害の観点から不法行為に該当し、民事上の責任を追及される場合もあります。ご注意ください。<br>
      <br>禁止事項5：無断で著作物を公開するなど、第三者の知的財産権を侵害すること<br>
      無断で著作物を公開するなど第三者の知的財産権を侵害することは禁止しています。<br>
      他人の著作物を引用する場合は、正当な引用にあたるかどうか、ご自身の責任で判断したうえで投稿してください。<br>
      画像や動画などを使うときは、他人の著作権や肖像権などの知的財産権を侵害しないかを確認してからご利用ください。なお、他人の著作物を無断で改変した画像や動画を使用した場合も、著作権侵害に該当するおそれがあります。<br>
      特に授業のレジュメ等の公開は著作権侵害に該当するのでご注意ください。<br>
      <br>禁止事項6：サービス運営を妨害する行為<br>
      大量の投稿を繰り返すなどして、Rits知恵袋のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為は禁止しています。<br>
      また、他人になりすましたり、他人に誤認を与える内容の投稿は禁止です。<br>
      そのほか、運営が不適切だと判断するもの<br>
      このページに記載されていない行為でも、運営が不適切だと判断した場合、なんらかの措置を行う可能性があります。<br>
      <br>

      ●Rits知恵袋の管理責任者について<br>
      立命館大学生・大学院生のオンライン交流を促進することを目的に、学生有志で「Rits知恵袋」を立ち上げました。Rits知恵袋について、プロジェクトメンバーが管理責任者となります。<br>
      <br>

      ●当ウェブサイトの収集する情報について<br>
      収集した個人情報については、管理責任者による適切な管理を行います。また、外部への流出防止、情報の紛失、破壊、改ざんの危険や外部からの不正なアクセス等の危険に対して、適切な安全対策を実施し、個人情報の保護に努めます。<br>
      <br>

      ●ガイドライン違反と判断した場合の対処について<br>
      みなさんの投稿が運営の利用規約に反していると運営が判断したときは、投稿の削除やRits知恵袋の利用停止といった措置を予告なく行う場合があります。<br>
      <br>

      ●Rits知恵袋で扱う情報内容について<br>
      Rits知恵袋上での情報は、ユーザーが独自に回答している情報で、正しい情報では無い場合があることをご理解の上、Rits知恵袋をご利用ください。<br>
      <br>

      ●利用規約の変更について<br>
      管理責任者が必要と判断した場合には、本利用規約を変更することができるものとします。<br>
      この場合、管理責任者は、本ウェブサイトへの掲載その他の適切な方法にて、本利用規約を変更する旨および変更後の本利用規約の内容ならびにその効力発生日を周知するものとします。<br>
      <br>

      ●さいごに<br>
      質問や回答をするときや、コメントなどを書くときに、これから投稿しようとしている内容が相手を傷つけないか、また、ほかの利用者に迷惑をかけることにならないか、上記の事項を参考にサービスへご参加ください。<br>

    </v-card-text>
    <v-card-actions>
      <v-spacer></v-spacer>
      <v-btn color="#0D47A1" text @click="dialog = false; agreeCheck = false;">同意しない</v-btn>
      <v-btn color="#E64A19" large text @click="dialog = false; agreeCheck = true;">同意する</v-btn>
    </v-card-actions>
  </v-card>
</template>


<style scoped>
.text {
  text-align: left;
}
.warning-text {
  color: #F44336;
  font-weight: bold;
}
</style>